In [1]:
import pandas as pd
import numpy as np

## Pandas have 2 types of objects : DataFrame and Series

In [2]:
arr = np.array([1, 2, 3, 4, 5])
arr

array([1, 2, 3, 4, 5])

In [3]:
df = pd.DataFrame(arr)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
np.random.seed(100)
arr = np.random.randint(1,10,(5,3))
arr

array([[9, 9, 4],
       [8, 8, 1],
       [5, 3, 6],
       [3, 3, 3],
       [2, 1, 9]], dtype=int32)

In [5]:
df = pd.DataFrame(arr)
df

   0  1  2
0  9  9  4
1  8  8  1
2  5  3  6
3  3  3  3
4  2  1  9

#### We can create a dataframe from List and Dictionary Also

In [6]:
rownames = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri']
colnames = ['Jan', 'Feb', 'Mar']    
df = pd.DataFrame(arr, index=rownames, columns=colnames)
df

     Jan  Feb  Mar
Mon    9    9    4
Tue    8    8    1
Wed    5    3    6
Thu    3    3    3
Fri    2    1    9

In [7]:
mydict = {
    'Jan' : [10, 20, 30, 40, 50],
    'Feb' : [15, 25, 35, 45, 55],
    'Mar' : [20, 30, 40, 50, 60]
}

df = pd.DataFrame(mydict,index=['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'])
df

           Jan  Feb  Mar
Monday      10   15   20
Tuesday     20   25   30
Wednesday   30   35   40
Thursday    40   45   50
Friday      50   55   60

## Series

A series is a single column extracted from a DataFrame.

In [8]:
ser = df['Jan'][0:3]
print(type(ser))
ser

<class 'pandas.core.series.Series'>

Monday       10
Tuesday      20
Wednesday    30
Name: Jan, dtype: int64

In [9]:
data = ['A', 'B', 'C', 'D', 'E']
ser = pd.Series(data , name='MySeries',index=range(1,6))
ser

1    A
2    B
3    C
4    D
5    E
Name: MySeries, dtype: object

# __Series manipulation__

In [10]:
data = [1,2,3,4,5,6]
ser = pd.Series(data,name="Series")
ser

0    1
1    2
2    3
3    4
4    5
5    6
Name: Series, dtype: int64

In [11]:
ser*2

0     2
1     4
2     6
3     8
4    10
5    12
Name: Series, dtype: int64

In [ ]:
ser1 = pd.Series([1,2,3,4,5],name='ser1',index=['a','b','c','d','e'])
ser2 = pd.Series([10,20,30,40,50],name='ser2',index=['a','b','c','d','f']) #If it do not have the same index, it will be NaN
ser1 + ser2

a    11.0
b    22.0
c    33.0
d    44.0
e     NaN
f     NaN
dtype: float64

.add method for adding 2 series

In [14]:
ser1.add(ser2,fill_value=0)

a    11.0
b    22.0
c    33.0
d    44.0
e     5.0
f    50.0
dtype: float64

.sub method for subtracting 2 series

In [17]:
ser2 - ser1

a     9.0
b    18.0
c    27.0
d    36.0
e     NaN
f     NaN
dtype: float64

In [18]:
ser1.sub(ser2,fill_value=0)

a    -9.0
b   -18.0
c   -27.0
d   -36.0
e     5.0
f   -50.0
dtype: float64